#Дано положительное действительное число X. Выведите его дробную часть. 
x= float (input ('input number'))
print (x-int(x))
