number=int(input())
print (number//100+(number%100)//10+number%10)
#Дано трехзначное число. Найдите сумму его цифр. 